server/app/controllers/api/v1/polls_controller.rb

SELECT "votes".* FROM "votes" WHERE "votes"."poll_id" = ?  [["poll_id", 1]]
SELECT "polls".* FROM "polls" WHERE "polls"."user_id" = ?  [["user_id", 1]]
---
    def index
        @polls = current_user.polls

        render json: @polls.map { |poll| poll.as_json_with_votes }

INSERT INTO "polls" ("title", "description", "user_id", "created_at", "updated_at", "choices", "authenticate") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
        @poll = Poll.new(poll_params.merge(user: current_user))

        if @poll.save

UPDATE "polls" SET "choices" = ?, "updated_at" = ? WHERE "polls"."id" = ?  [["choices", "[\"a\", \"b\", \"d\"]"], ["updated_at", "2022-06-08 14:35:54.620110"], ["id", 2]]
---
    def update
        if @poll.update(poll_params)

DELETE FROM "polls" WHERE "polls"."id" = ?  [["id", 1]]
---
    def destroy
        @poll.destroy

SELECT "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
---
    def set_poll
        @poll = Poll.find(params[:id])