server/app/controllers/api/v1/votes_controller.rb

    def create
        @vote = Vote.new(vote_params.merge(user: current_user))

        if @vote.save
---
INSERT INTO "votes" ("poll_id", "choice", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["poll_id", 1], ["choice", "2"], ["created_at", "2022-06-13 14:41:14.550008"], ["updated_at", "2022-06-13 14:41:14.550008"], ["user_id", 1]]

    def update
        if @vote.update(vote_params)
---
UPDATE "votes" SET "choice" = ?, "updated_at" = ? WHERE "votes"."id" = ?  [["choice", "3"], ["updated_at", "2022-06-13 19:27:47.599172"], ["id", 13]]

    def destroy
        @vote.destroy
---
DELETE FROM "votes" WHERE "votes"."id" = ?  [["id", 13]]

    def set_vote
        @vote = Vote.find(params[:id])
---
SELECT "votes".* FROM "votes" WHERE "votes"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]

    def authenticate_poll?
        @poll ||= @vote.poll if @vote.present?
        @poll ||= params[:poll_id] ? Poll.find(params[:poll_id]) : nil
---
SELECT "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]