server/app/models/poll.rb

SELECT "votes".* FROM "votes" WHERE "votes"."poll_id" = ?  [["poll_id", 1]]
---
  def as_json_with_votes
    self.as_json.merge(votes: self.votes.all.to_a)