server/app/models/concerns/choice_validable.rb

SELECT "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def validate_choice
    return if self.poll.choices.include?(self.choice)